nxp-mcuxpresso/mcux-sdk/devices/LPC5502/drivers/fsl_clock.h
    kMAIN_CLK_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 0),      /*!< Attach MAIN_CLK to FLEXCOMM7. */

    kPLL0_DIV_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1),      /*!< Attach PLL0_DIV to FLEXCOMM7. */

    kFRO12M_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 2),        /*!< Attach FRO12M to FLEXCOMM7. */

    kFRO_HF_DIV_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM7. */

    kFRO1M_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 4),         /*!< Attach FRO1M to FLEXCOMM7. */

    kMCLK_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 5),          /*!< Attach MCLK to FLEXCOMM7. */

    kOSC32K_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 6),        /*!< Attach OSC32K to FLEXCOMM7. */

    kNONE_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 7),          /*!< Attach NONE to FLEXCOMM7. */

    kMAIN_CLK_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 0),         /*!< Attach MAIN_CLK to HSLSPI. */

    kPLL0_DIV_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 1),         /*!< Attach PLL0_DIV to HSLSPI. */

    kFRO12M_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 2),           /*!< Attach FRO12M to HSLSPI. */

    kFRO_HF_DIV_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 3),       /*!< Attach FRO_HF_DIV to HSLSPI. */

    kFRO1M_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 4),            /*!< Attach FRO1M to HSLSPI. */

    kOSC32K_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 6),           /*!< Attach OSC32K to HSLSPI. */

    kNONE_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 7),             /*!< Attach NONE to HSLSPI. */

    kFRO_HF_to_MCLK = MUX_A(CM_MCLKCLKSEL, 0),               /*!< Attach FRO_HF to MCLK. */

    kPLL0_to_MCLK = MUX_A(CM_MCLKCLKSEL, 1),                 /*!< Attach PLL0 to MCLK. */

    kNONE_to_MCLK = MUX_A(CM_MCLKCLKSEL, 7),                 /*!< Attach NONE to MCLK. */

    kMAIN_CLK_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 0),           /*!< Attach MAIN_CLK to SCT_CLK. */

    kPLL0_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 1),               /*!< Attach PLL0 to SCT_CLK. */

    kEXT_CLK_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 2),            /*!< Attach EXT_CLK to SCT_CLK. */

    kFRO_HF_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 3),             /*!< Attach FRO_HF to SCT_CLK. */

    kMCLK_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 5),               /*!< Attach MCLK to SCT_CLK. */

    kNONE_to_SCT_CLK = MUX_A(CM_SCTCLKSEL, 7),               /*!< Attach NONE to SCT_CLK. */

    kFRO32K_to_OSC32K = MUX_A(CM_RTCOSC32KCLKSEL, 0),        /*!< Attach FRO32K to OSC32K. */

    kXTAL32K_to_OSC32K = MUX_A(CM_RTCOSC32KCLKSEL, 1),       /*!< Attach XTAL32K to OSC32K. */

    kOSC32K_to_OSTIMER = MUX_A(CM_OSTIMERCLKSEL, 0),         /*!< Attach OSC32K to OSTIMER. */

    kFRO1M_to_OSTIMER = MUX_A(CM_OSTIMERCLKSEL, 1),          /*!< Attach FRO1M to OSTIMER. */

    kMAIN_CLK_to_OSTIMER = MUX_A(CM_OSTIMERCLKSEL, 2),       /*!< Attach MAIN_CLK to OSTIMER. */

    kTRACE_DIV_to_TRACE = MUX_A(CM_TRACECLKSEL, 0),          /*!< Attach TRACE_DIV to TRACE. */

    kFRO1M_to_TRACE = MUX_A(CM_TRACECLKSEL, 1),              /*!< Attach FRO1M to TRACE. */

    kOSC32K_to_TRACE = MUX_A(CM_TRACECLKSEL, 2),             /*!< Attach OSC32K to TRACE. */

    kNONE_to_TRACE = MUX_A(CM_TRACECLKSEL, 7),               /*!< Attach NONE to TRACE. */

    kSYSTICK_DIV0_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 0), /*!< Attach SYSTICK_DIV0 to SYSTICK0. */

    kFRO1M_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 1),        /*!< Attach FRO1M to SYSTICK0. */

    kOSC32K_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 2),       /*!< Attach OSC32K to SYSTICK0. */

    kNONE_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 7),         /*!< Attach NONE to SYSTICK0. */

    kFRO12M_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 0),               /*!< Attach FRO12M to PLL1. */

    kEXT_CLK_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 1),              /*!< Attach EXT_CLK to PLL1. */

    kFRO1M_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 2),                /*!< Attach FRO1M to PLL1. */

    kOSC32K_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 3),               /*!< Attach OSC32K to PLL1. */

    kNONE_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 7),                 /*!< Attach NONE to PLL1. */

    kMAIN_CLK_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 0),       /*!< Attach MAIN_CLK to CTIMER0. */

    kPLL0_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 1),           /*!< Attach PLL0 to CTIMER0. */

    kFRO_HF_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 3),         /*!< Attach FRO_HF to CTIMER0. */

    kFRO1M_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 4),          /*!< Attach FRO1M to CTIMER0. */

    kMCLK_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 5),           /*!< Attach MCLK to CTIMER0. */

    kOSC32K_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 6),         /*!< Attach OSC32K to CTIMER0. */

    kNONE_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 7),           /*!< Attach NONE to CTIMER0. */

    kMAIN_CLK_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 0),       /*!< Attach MAIN_CLK to CTIMER1. */

    kPLL0_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 1),           /*!< Attach PLL0 to CTIMER1. */

    kFRO_HF_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 3),         /*!< Attach FRO_HF to CTIMER1. */

    kFRO1M_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 4),          /*!< Attach FRO1M to CTIMER1. */

    kMCLK_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 5),           /*!< Attach MCLK to CTIMER1. */

    kOSC32K_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 6),         /*!< Attach OSC32K to CTIMER1. */

    kNONE_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 7),           /*!< Attach NONE to CTIMER1. */

    kMAIN_CLK_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 0),       /*!< Attach MAIN_CLK to CTIMER2. */

    kPLL0_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 1),           /*!< Attach PLL0 to CTIMER2. */

    kFRO_HF_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 3),         /*!< Attach FRO_HF to CTIMER2. */

    kFRO1M_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 4),          /*!< Attach FRO1M to CTIMER2. */

    kMCLK_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 5),           /*!< Attach MCLK to CTIMER2. */

    kOSC32K_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 6),         /*!< Attach OSC32K to CTIMER2. */

    kNONE_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 7),           /*!< Attach NONE to CTIMER2. */

    kMAIN_CLK_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 0),       /*!< Attach MAIN_CLK to CTIMER3. */

    kPLL0_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 1),           /*!< Attach PLL0 to CTIMER3. */

    kFRO_HF_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 3),         /*!< Attach FRO_HF to CTIMER3. */

    kFRO1M_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 4),          /*!< Attach FRO1M to CTIMER3. */

    kMCLK_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 5),           /*!< Attach MCLK to CTIMER3. */

    kOSC32K_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 6),         /*!< Attach OSC32K to CTIMER3. */

    kNONE_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 7),           /*!< Attach NONE to CTIMER3. */

